Autodesk.Revit.DB.ExternalService.IExternalService.OnServersChanged(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ExternalService.ServerChangeCause,System.Collections.Generic.IList{System.Guid})
Implement this method to handle situations when servers for the service have changed.
Remarks:
This method may only be invoked in a recordable service.
Services registered as non-recordable never receive this call.
It is imperative to understand this method is not called just when an active server (or servers)
is (are) changed for a service. It is invoked only when the active server is changed so it is
different from those previously used (i.e. actually executed) in a document. Because of that,
this notification is never sent when active server is set or reset in a document in which the
service was never executed before.
If a document has explicitly set active server (or servers), OnServersChanged is never called
for that document when the application-wide active server (servers) gets changed. The document
would still be executed with its own active servers applied.
A similar case is when the active server (servers) is unset for a document but the currently
active application-wide server happens to be the same as the one that was set in the document.
It is up to the service provider to decide what should be the appropriate action. In some cases,
if not all, the service will probably want to execute again, now with the new active server(s),
but that it is not necessary - the service invoker may as well decide to wait for the end-user
to trigger execution if the service (e.g. by clicking a corresponding command in the menu.)
document:
The corresponding document
cause:
Indicates in what situation the servers are changed. Currently available values indicate
whether the change is a result of an explicit user request, or by an implicit change of
situation within the service - for example when a document is updated upon opening.
oldServers:
Ids of servers previously used in the document. Please note that the Ids may
belong to servers that are not registered with service anymore.
Since:
2013

Autodesk.Revit.DB.ExternalService.IExternalService.OnServersDisparity(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{System.Guid})
Implements this method to get notified that the servers  in a just
opened document differ from those currently set as active for the service.
Remarks:
This method may only be invoked in a recordable service.
Services registered as non-recordable never receive this call.
This notification is sent when Revit opens a document which has a record of
the service used (executed at least once) and the record shows that the server
(or servers) used differ from those currently set as active for the service.
Unless the situation is explicitly handled in this call (by returning DoNothing),
the framework will follow up by assigning the formerly used servers as the
currently active servers of that document. After it will notify the service
about the change by invoking the OnServersChanged method on the services interface.
document:
The coresponding document
oldServers:
Ids of servers previously used in the document. Please note that the Ids may
belong to servers that are currently not registered with the service.
Returns:
Return DoNothing if the situation has been completely handled by your service;
If not, reply with either ApplyDefaults (typical case) or LetUserDecide.
Since:
2013

Autodesk.Revit.DB.ExternalService.IExternalService.Execute(Autodesk.Revit.DB.ExternalService.IExternalServer,Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ExternalService.IExternalData)
Implement this method to execute the given server.
Remarks:
It is completely upon the service to decide what the communication with the server should be like,
for it is the service provider who also defines what the server's interface looks like.
It could be as simple as calling one method (e.g. Execute, Run, Calculate, etc.) or it could be
a set of inquiries and executing calls to the server.
The framework invokes this method when the service is requested to be executed.
The framework first checks what the applicable server (or servers, in a multi-server
service) is and then it calls this method with that server as an argument.
server:
An instance of a server that is to be executed.
document:
The associated document. It may be NULL if the service is not being executed
in a document.
data:
The associated service data.
Returns:
True indicates a successful execution of the call. False indicates a failure.
If a multi-server service returns false from the call, the service manager
will stop the execution loop and marks the service execution as unsuccessful.
Since:
2013

Autodesk.Revit.DB.ExternalService.IExternalService.IsValidServer(Autodesk.Revit.DB.ExternalService.IExternalServer)
Implement this method to check if the given instance represents a valid server of this service.
Remarks:
This method is invoked by the framework upon registration of a server for this service.
The simplest implementation would be to test whether the type of the object is as expected,
but a service may have other rules for validating its servers.
server:
An instance of a server that is to be validated.
Returns:
True if the server is valid, False otherwise
Since:
2013

Autodesk.Revit.DB.ExternalService.IExternalService.GetDescription
Implement this method to return a description of the service.
Remarks:
The purpose of this string is to describe the external service
in more details than just a short name alone could do.
The intended use is to show the string to the end user in UI
when UI is appropriate for the service.
Beside the requirement for it to be a non-empty string,
there are no other general restrictions imposed by the External Services Framework.
Returns:
Description of the service.
Since:
2013

Autodesk.Revit.DB.ExternalService.IExternalService.GetVendorId
Implement this method to return the vendor Id of the service.
Remarks:
The Id is expected to be a string consisting of 4 characters.
Returns:
Vendor Id of the service.
Since:
2013

Autodesk.Revit.DB.ExternalService.IExternalService.GetName
Implement this method to return the name of the service.
Remarks:
Although an external  service is uniquely identified by its Id, the Name
can identify it to the end user in UI when UI is appropriate for the service.
Beside the requirement for the name to be a non-empty string,
there are no other general restrictions imposed by the External Services Framework.
Returns:
Name of the service.
Since:
2013

Autodesk.Revit.DB.ExternalService.IExternalService.GetServiceId
Implement this method to return the unique Id of the service.
Remarks:
For all built-in external services, their Ids are all items
of the enumerated type ExternalServices.BuiltInExternalServices.
Third-party services will have their respective Ids based on GUIDs.
It is important to note that a service Id must be unique. It will
be an error if two external services try to register with the same Id.
Returns:
The extensible enum value representing the Id of the service.
Since:
2013

Autodesk.Revit.DB.ExternalService.IExternalService
The base interface class for all external services.
Remarks:
Both supported kinds of services - single-server and multi-server - will derive their classes
from this interface, albeit indirectly through an interface specific to the particular kind.
External services never derive directly from this class - they always have to derive from
either ISingleServerService or IMultiServerService, respectivelly.
Since:
2013